Alekey01/oled_i2c/sdkconfig.defaults
# --- Seeed Studio XIAO ESP32-S3 ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Consola por el USB nativo de la placa
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Particiones: dos ranuras de app para poder actualizar por BLE.
# OJO: cambiar de tabla obliga a un borrado completo la primera vez
# (idf.py erase-flash), porque el mapa de la flash ya no coincide.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Si el firmware nuevo no llega a confirmarse, el bootloader vuelve al anterior.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# --- Bluetooth LE (NimBLE). El ESP32-S3 no tiene Bluetooth Classic. ---
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1

# MTU grande para el OTA: con los 23 por defecto quedan 20 bytes utiles por
# escritura y medio mega tardaria una eternidad.
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517

# Diagnostico de un reinicio en bucle al arrancar BLE: asserts extra del host
# NimBLE y medio segundo de margen para que el backtrace llegue a la consola
# USB antes del reset.
CONFIG_BT_NIMBLE_DEBUG=y
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=1

# --- Ahorro de energia ---
# El controlador BLE del ESP32-S3 puede usar el cristal principal como reloj de
# baja potencia, asi que el light sleep funciona sin cristal externo de 32 kHz.
# A cambio, el cristal principal sigue alimentado mientras duerme.
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80=y
CONFIG_BT_CTRL_MODEM_SLEEP=y
CONFIG_BT_CTRL_MODEM_SLEEP_MODE_1=y
CONFIG_BT_CTRL_LPCLK_SEL_MAIN_XTAL=y
CONFIG_BT_CTRL_MAIN_XTAL_PU_DURING_LIGHT_SLEEP=y

# Stack del main task
CONFIG_ESP_MAIN_TASK_STACK_SIZE=7168

CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_BOOTLOADER_LOG_LEVEL=2
